Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/svd/PIC32CX2051MTG128.svd
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK21Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK22</name>
                        <description>PIO Line 22 Mask</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK22Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK23</name>
                        <description>PIO Line 23 Mask</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK23Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK24</name>
                        <description>PIO Line 24 Mask</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK24Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK25</name>
                        <description>PIO Line 25 Mask</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK25Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK26</name>
                        <description>PIO Line 26 Mask</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK26Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK27</name>
                        <description>PIO Line 27 Mask</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK27Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK28</name>
                        <description>PIO Line 28 Mask</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK28Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK29</name>
                        <description>PIO Line 29 Mask</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK29Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK30</name>
                        <description>PIO Line 30 Mask</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK30Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK31</name>
                        <description>PIO Line 31 Mask</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK31Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
