Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/svd/PIC32CX2051MTG128.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SEFC0</name>
         <version>04463F</version>
         <description>Secure Embedded Flash Controller</description>
         <groupName>SEFC</groupName>
         <prependToName>SEFC_</prependToName>
         <baseAddress>0x460E0000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xE8</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SEFC0</name>
            <value>7</value>
         </interrupt>
         <registers>
            <register>
               <name>EEFC_FMR</name>
               <description>SEFC Flash Mode Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FRDY</name>
                     <description>Flash Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FWS</name>
                     <description>Flash Wait State</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SCOD</name>
                     <description>Sequential Code Optimization Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLOE</name>
                     <description>Code Loop Optimization Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALWAYS1</name>
                     <description>Always Written to One</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EEFC_FCR</name>
               <description>SEFC Flash Command Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>FCMD</name>
                     <description>Flash Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>FCMDSelect</name>
                        <enumeratedValue>
                           <name>GETD</name>
                           <description>Get Flash descriptor</description>
                           <value>0x00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WP</name>
                           <description>Write page</description>
                           <value>0x01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WPL</name>
                           <description>Write page and lock</description>
                           <value>0x02</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EPA</name>
                           <description>Erase pages (8, 16, 32, 64)</description>
                           <value>0x07</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLB</name>
                           <description>Set lock bit</description>
                           <value>0x08</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLB</name>
                           <description>Clear lock bit</description>
                           <value>0x09</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GLB</name>
                           <description>Get lock bit</description>
                           <value>0x0A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SGPB</name>
                           <description>Set GPNVM bit</description>
                           <value>0x0B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGPB</name>
                           <description>Clear GPNVM bit</description>
                           <value>0x0C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GGPB</name>
                           <description>Get GPNVM bit</description>
                           <value>0x0D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STUI</name>
                           <description>Start read unique identifier</description>
                           <value>0x0E</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPUI</name>
                           <description>Stop read unique identifier</description>
                           <value>0x0F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCALB</name>
                           <description>Get CALIB bit</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ES</name>
                           <description>Erase sector</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WUS</name>
                           <description>Write user signature</description>
                           <value>0x12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EUS</name>
                           <description>Erase user signature</description>
                           <value>0x13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STUS</name>
                           <description>Start read user signature</description>
                           <value>0x14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPUS</name>
                           <description>Stop read user signature</description>
                           <value>0x15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUSP</name>
                           <description>Suspend</description>
                           <value>0x17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RES</name>
                           <description>Resume</description>
                           <value>0x18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCK</name>
                           <description>Send cryptographic key</description>
                           <value>0x19</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FARG</name>
                     <description>Flash Command Argument</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>FKEY</name>
                     <description>Flash Writing Protection Key</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>FKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>The 0x5A value enables the command defined by the bits in the register. If the field is written with a different value, the write is not performed and no action is started.</description>
                           <value>0x5A</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EEFC_FSR</name>
               <description>SEFC Flash Status Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FRDY</name>
                     <description>Flash Ready Status (cleared when Flash is busy)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCMDE</name>
                     <description>Flash Command Error Status (cleared on read)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLOCKE</name>
                     <description>Flash Lock Error Status (cleared on read or by writing EEFC_FCR)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLERR</name>
                     <description>Flash Error Status (cleared when a programming operation starts)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPERR</name>
                     <description>Write Protection Error Status (cleared on read)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLSUSP</name>
                     <description>Flash Suspended Status (cleared when resuming the programming operation)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECCELSBD</name>
                     <description>Single ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MECCELSBD</name>
                     <description>Multiple ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECCEMSBD</name>
                     <description>Single ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MECCEMSBD</name>
                     <description>Multiple ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECCELSBL</name>
                     <description>Single ECC Error on LSB Part of the Memory Lock Bits</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MECCELSBL</name>
                     <description>Multiple ECC Error on LSB Part of the Memory Lock Bits</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECCEMSBL</name>
                     <description>Single ECC Error on MSB Part of the Memory Lock Bits</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MECCEMSBL</name>
                     <description>Multiple ECC Error on MSB Part of the Memory Lock Bits</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EEFC_FRR</name>
               <description>SEFC Flash Result Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FVALUE</name>
                     <description>Flash Result Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EEFC_USR</name>
               <description>SEFC User Signature Rights Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RDENUSB0</name>
                     <description>Read Enable for User Signature Block 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDENUSB1</name>
                     <description>Read Enable for User Signature Block 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDENUSB2</name>
                     <description>Read Enable for User Signature Block 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDENUSB3</name>
                     <description>Read Enable for User Signature Block 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDENUSB4</name>
                     <description>Read Enable for User Signature Block 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDENUSB5</name>
                     <description>Read Enable for User Signature Block 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDENUSB6</name>
                     <description>Read Enable for User Signature Block 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDENUSB7</name>
                     <description>Read Enable for User Signature Block 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRENUSB0</name>
                     <description>Write Enable for User Signature Block 0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRENUSB1</name>
                     <description>Write Enable for User Signature Block 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRENUSB2</name>
                     <description>Write Enable for User Signature Block 2</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRENUSB3</name>
                     <description>Write Enable for User Signature Block 3</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRENUSB4</name>
                     <description>Write Enable for User Signature Block 4</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRENUSB5</name>
                     <description>Write Enable for User Signature Block 5</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRENUSB6</name>
                     <description>Write Enable for User Signature Block 6</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRENUSB7</name>
                     <description>Write Enable for User Signature Block 7</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVUSB0</name>
                     <description>Privileged Access for User Signature Block 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVUSB1</name>
                     <description>Privileged Access for User Signature Block 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVUSB2</name>
                     <description>Privileged Access for User Signature Block 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVUSB3</name>
                     <description>Privileged Access for User Signature Block 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVUSB4</name>
                     <description>Privileged Access for User Signature Block 4</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVUSB5</name>
                     <description>Privileged Access for User Signature Block 5</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVUSB6</name>
                     <description>Privileged Access for User Signature Block 6</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVUSB7</name>
                     <description>Privileged Access for User Signature Block 7</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKUSRB0</name>
                     <description>Lock User Signature Rights for User Signature Block 0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKUSRB1</name>
                     <description>Lock User Signature Rights for User Signature Block 1</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKUSRB2</name>
                     <description>Lock User Signature Rights for User Signature Block 2</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKUSRB3</name>
                     <description>Lock User Signature Rights for User Signature Block 3</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKUSRB4</name>
                     <description>Lock User Signature Rights for User Signature Block 4</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKUSRB5</name>
                     <description>Lock User Signature Rights for User Signature Block 5</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKUSRB6</name>
                     <description>Lock User Signature Rights for User Signature Block 6</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKUSRB7</name>
                     <description>Lock User Signature Rights for User Signature Block 7</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
